

ENGLISH_ZERO = """
  Task Description:
  You need to label a given Persian token list with named entity labels.
  Named Entity Labels:

  PER (person)
  LOC (location)
  ORG (organization)
  Product (Product)
  Event (Event)
  Facility (Facility)

  Output Format:
  Your output format should be a list of tuples, where each tuple consists of a word from the input text and its corresponding named entity label.
  For words which are not part of any named entity, you should return 'O'.

  Input:
  {input}
  """

PERSIAN_ZERO = """

  شرح وظیفه:
  شما باید یک لیست توکن فارسی داده شده را با برچسب های موجودیت اسمی برچسب گذاری کنید.
  برچسب های موجودیت اسمی:

  PER (نفر)
  LOC (مکان)
  ORG (سازمان)
  Product (محصول)
  Event (رویداد)
  Facility (تاسیسات)

  فرمت خروجی:
  فرمت خروجی شما باید لیستی از تاپل ها باشد، که در آن هر تاپل از یک کلمه از متن ورودی و برچسب موجودیت اسمی مربوط به آن تشکیل شده باشد.
  برای کلماتی که بخشی از هیچ موجودیت اسمی نیستند، باید \"O\" را برگردانید.

  ورودی:
  {input}

  """

ENGLISH_ONE = """
  Task Description:
  You need to label a given Persian token list with named entity labels.
  Named Entity Labels:

  PER (person)
  LOC (location)
  ORG (organization)
  Product (Product)
  Event (Event)
  Facility (Facility)

  Here, we provide you examples of the task:
    

  Example 1:
      Input: ['حمید', 'طاهایی', 'افزود', ':', 'برای', 'اجرای', 'این', 'طرحها', '0', 'میلیارد', 'و', '0', 'میلیون', 'ریال', 'اعتبار', 'هزینه', 'شده', 'است', '.']
      Output: [('حمید', 'PER'), ('طاهایی', 'PER'), ('افزود', 'O'), (':', 'O'), ('برای', 'O'), ('اجرای', 'O'), ('این', 'O'), ('طرحها', 'O'), ('0', 'O'), ('میلیارد', 'O'), ('و', 'O'), ('0', 'O'), ('میلیون', 'O'), ('ریال', 'O'), ('اعتبار', 'O'), ('هزینه', 'O'), ('شده', 'O'), ('است', 'O'), ('.', 'O')]

  

  Example 2:
      Input: ['جشنواره', 'فیلم', 'دفاع', 'مقدس', 'از', '0', 'تا', '0', 'مهرماه', 'در', 'چهار', 'سینمای', 'تهران', 'و', 'فرهنگسرای', 'نیاوران', 'و', 'بهمن', 'بر', 'پا', 'می\u200cشود', '.']
      Output: [('جشنواره', 'Event'), ('فیلم', 'Event'), ('دفاع', 'Event'), ('مقدس', 'Event'), ('از', 'O'), ('0', 'O'), ('تا', 'O'), ('0', 'O'), ('مهرماه', 'O'), ('در', 'O'), ('چهار', 'O'), ('سینمای', 'O'), ('تهران', 'LOC'), ('و', 'O'), ('فرهنگسرای', 'Facility'), ('نیاوران', 'Facility'), ('و', 'O'), ('بهمن', 'Facility'), ('بر', 'O'), ('پا', 'O'), ('می\u200cشود', 'O'), ('.', 'O')]

  

  Example 3:
      Input: ['ایرن', 'ژاکوب', '،', 'هنرپیشه', 'فرانسوی', 'نیز', 'قرار', 'است', 'در', 'این', 'تئاتر', 'نقش', 'مقابل', 'کالکین', 'را', 'به', 'عهده', 'بگیرد', '.']
      Output: [('ایرن', 'PER'), ('ژاکوب', 'PER'), ('،', 'O'), ('هنرپیشه', 'O'), ('فرانسوی', 'ORG'), ('نیز', 'O'), ('قرار', 'O'), ('است', 'O'), ('در', 'O'), ('این', 'O'), ('تئاتر', 'O'), ('نقش', 'O'), ('مقابل', 'O'), ('کالکین', 'PER'), ('را', 'O'), ('به', 'O'), ('عهده', 'O'), ('بگیرد', 'O'), ('.', 'O')]

  

  Example 4:
      Input: ['برنامه', 'موسیقی', 'دوتارنوازی', 'به', 'معرفی', 'موسیقی', 'تربت\u200cجام', 'از', 'خطه', 'خراسان', 'می\u200cپردازد', '.']
      Output: [('برنامه', 'O'), ('موسیقی', 'O'), ('دوتارنوازی', 'O'), ('به', 'O'), ('معرفی', 'O'), ('موسیقی', 'O'), ('تربت\u200cجام', 'LOC'), ('از', 'O'), ('خطه', 'O'), ('خراسان', 'LOC'), ('می\u200cپردازد', 'O'), ('.', 'O')]

  

  Example 5:
      Input: ['رومئو', 'و', 'ژولیت', 'تمدید', 'شد', '.']
      Output: [('رومئو', 'Product'), ('و', 'Product'), ('ژولیت', 'Product'), ('تمدید', 'O'), ('شد', 'O'), ('.', 'O')]

  

  Example 6:
      Input: ['تامسون', 'كه', '0', 'سال', 'دارد', '،', 'در', 'فیلم', 'آرزوهای', 'بزرگ', '،', 'برگرفته', 'از', 'رمان', 'چارلز', 'دیکنز', 'بازی', 'کرده', 'است', '.']
      Output: [('تامسون', 'PER'), ('كه', 'O'), ('0', 'O'), ('سال', 'O'), ('دارد', 'O'), ('،', 'O'), ('در', 'O'), ('فیلم', 'Product'), ('آرزوهای', 'Product'), ('بزرگ', 'Product'), ('،', 'O'), ('برگرفته', 'O'), ('از', 'O'), ('رمان', 'O'), ('چارلز', 'PER'), ('دیکنز', 'PER'), ('بازی', 'O'), ('کرده', 'O'), ('است', 'O'), ('.', 'O')]

  

  Example 7:
      Input: ['رئیس', 'قوه', 'قضائیه', ':', 'درباره', 'مجازات', 'زندان', 'باید', 'تحولاتی', 'به', 'وجود', 'آید', '.']
      Output: [('رئیس', 'O'), ('قوه', 'ORG'), ('قضائیه', 'ORG'), (':', 'O'), ('درباره', 'O'), ('مجازات', 'O'), ('زندان', 'O'), ('باید', 'O'), ('تحولاتی', 'O'), ('به', 'O'), ('وجود', 'O'), ('آید', 'O'), ('.', 'O')]

  

  Output Format:
  Your output format should be a list of tuples, where each tuple consists of a word from the input text and its corresponding named entity label.
  For words which are not part of any named entity, you should return 'O'.

  Input:
  {input}
  """

PERSIAN_ONE = """
  شرح وظیفه:
  شما باید یک لیست توکن فارسی داده شده را با برچسب های موجودیت اسمی برچسب گذاری کنید.
  برچسب های موجودیت اسمی:

  PER (نفر)
  LOC (مکان)
  ORG (سازمان)
  Product (محصول)
  Event (رویداد)
  Facility (تاسیسات)

  در اینجا تعدادی مثال برای این تسک آمده است:
    

  مثال 1:
      ورودی: ['حمید', 'طاهایی', 'افزود', ':', 'برای', 'اجرای', 'این', 'طرحها', '0', 'میلیارد', 'و', '0', 'میلیون', 'ریال', 'اعتبار', 'هزینه', 'شده', 'است', '.']
      خروجی: [('حمید', 'PER'), ('طاهایی', 'PER'), ('افزود', 'O'), (':', 'O'), ('برای', 'O'), ('اجرای', 'O'), ('این', 'O'), ('طرحها', 'O'), ('0', 'O'), ('میلیارد', 'O'), ('و', 'O'), ('0', 'O'), ('میلیون', 'O'), ('ریال', 'O'), ('اعتبار', 'O'), ('هزینه', 'O'), ('شده', 'O'), ('است', 'O'), ('.', 'O')]

  

  مثال 2:
      ورودی: ['جشنواره', 'فیلم', 'دفاع', 'مقدس', 'از', '0', 'تا', '0', 'مهرماه', 'در', 'چهار', 'سینمای', 'تهران', 'و', 'فرهنگسرای', 'نیاوران', 'و', 'بهمن', 'بر', 'پا', 'می\u200cشود', '.']
      خروجی: [('جشنواره', 'Event'), ('فیلم', 'Event'), ('دفاع', 'Event'), ('مقدس', 'Event'), ('از', 'O'), ('0', 'O'), ('تا', 'O'), ('0', 'O'), ('مهرماه', 'O'), ('در', 'O'), ('چهار', 'O'), ('سینمای', 'O'), ('تهران', 'LOC'), ('و', 'O'), ('فرهنگسرای', 'Facility'), ('نیاوران', 'Facility'), ('و', 'O'), ('بهمن', 'Facility'), ('بر', 'O'), ('پا', 'O'), ('می\u200cشود', 'O'), ('.', 'O')]

  

  مثال 3:
      ورودی: ['ایرن', 'ژاکوب', '،', 'هنرپیشه', 'فرانسوی', 'نیز', 'قرار', 'است', 'در', 'این', 'تئاتر', 'نقش', 'مقابل', 'کالکین', 'را', 'به', 'عهده', 'بگیرد', '.']
      خروجی: [('ایرن', 'PER'), ('ژاکوب', 'PER'), ('،', 'O'), ('هنرپیشه', 'O'), ('فرانسوی', 'ORG'), ('نیز', 'O'), ('قرار', 'O'), ('است', 'O'), ('در', 'O'), ('این', 'O'), ('تئاتر', 'O'), ('نقش', 'O'), ('مقابل', 'O'), ('کالکین', 'PER'), ('را', 'O'), ('به', 'O'), ('عهده', 'O'), ('بگیرد', 'O'), ('.', 'O')]

  

  مثال 4:
      ورودی: ['برنامه', 'موسیقی', 'دوتارنوازی', 'به', 'معرفی', 'موسیقی', 'تربت\u200cجام', 'از', 'خطه', 'خراسان', 'می\u200cپردازد', '.']
      خروجی: [('برنامه', 'O'), ('موسیقی', 'O'), ('دوتارنوازی', 'O'), ('به', 'O'), ('معرفی', 'O'), ('موسیقی', 'O'), ('تربت\u200cجام', 'LOC'), ('از', 'O'), ('خطه', 'O'), ('خراسان', 'LOC'), ('می\u200cپردازد', 'O'), ('.', 'O')]

  

  مثال 5:
      ورودی: ['رومئو', 'و', 'ژولیت', 'تمدید', 'شد', '.']
      خروجی: [('رومئو', 'Product'), ('و', 'Product'), ('ژولیت', 'Product'), ('تمدید', 'O'), ('شد', 'O'), ('.', 'O')]

  

  مثال 6:
      ورودی: ['تامسون', 'كه', '0', 'سال', 'دارد', '،', 'در', 'فیلم', 'آرزوهای', 'بزرگ', '،', 'برگرفته', 'از', 'رمان', 'چارلز', 'دیکنز', 'بازی', 'کرده', 'است', '.']
      خروجی: [('تامسون', 'PER'), ('كه', 'O'), ('0', 'O'), ('سال', 'O'), ('دارد', 'O'), ('،', 'O'), ('در', 'O'), ('فیلم', 'Product'), ('آرزوهای', 'Product'), ('بزرگ', 'Product'), ('،', 'O'), ('برگرفته', 'O'), ('از', 'O'), ('رمان', 'O'), ('چارلز', 'PER'), ('دیکنز', 'PER'), ('بازی', 'O'), ('کرده', 'O'), ('است', 'O'), ('.', 'O')]

  

  مثال 7:
      ورودی: ['رئیس', 'قوه', 'قضائیه', ':', 'درباره', 'مجازات', 'زندان', 'باید', 'تحولاتی', 'به', 'وجود', 'آید', '.']
      خروجی: [('رئیس', 'O'), ('قوه', 'ORG'), ('قضائیه', 'ORG'), (':', 'O'), ('درباره', 'O'), ('مجازات', 'O'), ('زندان', 'O'), ('باید', 'O'), ('تحولاتی', 'O'), ('به', 'O'), ('وجود', 'O'), ('آید', 'O'), ('.', 'O')]

  

  فرمت خروجی:
  فرمت خروجی شما باید لیستی از تاپل ها باشد، که در آن هر تاپل از یک کلمه از متن ورودی و برچسب موجودیت اسمی مربوط به آن تشکیل شده باشد.
  برای کلماتی که بخشی از هیچ موجودیت اسمی نیستند، باید \"O\" را برگردانید.

  ورودی:
  {input}
  """

ENGLISH_THREE = """
  Task Description:
  You need to label a given Persian token list with named entity labels.
  Named Entity Labels:

  PER (person)
  LOC (location)
  ORG (organization)
  Product (Product)
  Event (Event)
  Facility (Facility)

  Here, we provide you examples of the task:
    

  Example 1:
      Input: ['حمید', 'طاهایی', 'افزود', ':', 'برای', 'اجرای', 'این', 'طرحها', '0', 'میلیارد', 'و', '0', 'میلیون', 'ریال', 'اعتبار', 'هزینه', 'شده', 'است', '.']
      Output: [('حمید', 'PER'), ('طاهایی', 'PER'), ('افزود', 'O'), (':', 'O'), ('برای', 'O'), ('اجرای', 'O'), ('این', 'O'), ('طرحها', 'O'), ('0', 'O'), ('میلیارد', 'O'), ('و', 'O'), ('0', 'O'), ('میلیون', 'O'), ('ریال', 'O'), ('اعتبار', 'O'), ('هزینه', 'O'), ('شده', 'O'), ('است', 'O'), ('.', 'O')]

  

  Example 2:
      Input: ['مهندس', 'حبیب\u200cالله', 'بیطرف', '،', 'به', 'هنگام', 'دیدار', 'از', 'پروژه', 'مذکور', 'گفت', ':', 'هزینه', 'این', 'طرح', 'از', 'محل', 'اعتبارات', 'ملی', 'تهیه', 'می\u200cشود', '.']
      Output: [('مهندس', 'O'), ('حبیب\u200cالله', 'PER'), ('بیطرف', 'PER'), ('،', 'O'), ('به', 'O'), ('هنگام', 'O'), ('دیدار', 'O'), ('از', 'O'), ('پروژه', 'O'), ('مذکور', 'O'), ('گفت', 'O'), (':', 'O'), ('هزینه', 'O'), ('این', 'O'), ('طرح', 'O'), ('از', 'O'), ('محل', 'O'), ('اعتبارات', 'O'), ('ملی', 'O'), ('تهیه', 'O'), ('می\u200cشود', 'O'), ('.', 'O')]

  

  Example 3:
      Input: ['هزینه', 'اجرای', 'طرح', 'آبرسانی', 'به', 'شهرضا', '0', 'میلیارد', 'ریال', 'اعلام', 'شده', 'است', '.']
      Output: [('هزینه', 'O'), ('اجرای', 'O'), ('طرح', 'O'), ('آبرسانی', 'O'), ('به', 'O'), ('شهرضا', 'LOC'), ('0', 'O'), ('میلیارد', 'O'), ('ریال', 'O'), ('اعلام', 'O'), ('شده', 'O'), ('است', 'O'), ('.', 'O')]

  

  Example 4:
      Input: ['مزارع', 'سبز', 'سویا', 'در', 'استان', 'گلستان', 'حدود', '0', 'هزار', 'هکتار', 'است', '.']
      Output: [('مزارع', 'O'), ('سبز', 'O'), ('سویا', 'O'), ('در', 'O'), ('استان', 'LOC'), ('گلستان', 'LOC'), ('حدود', 'O'), ('0', 'O'), ('هزار', 'O'), ('هکتار', 'O'), ('است', 'O'), ('.', 'O')]

  

  Example 5:
      Input: ['جشنواره', 'فیلم', 'دفاع', 'مقدس', 'از', '0', 'تا', '0', 'مهرماه', 'در', 'چهار', 'سینمای', 'تهران', 'و', 'فرهنگسرای', 'نیاوران', 'و', 'بهمن', 'بر', 'پا', 'می\u200cشود', '.']
      Output: [('جشنواره', 'Event'), ('فیلم', 'Event'), ('دفاع', 'Event'), ('مقدس', 'Event'), ('از', 'O'), ('0', 'O'), ('تا', 'O'), ('0', 'O'), ('مهرماه', 'O'), ('در', 'O'), ('چهار', 'O'), ('سینمای', 'O'), ('تهران', 'LOC'), ('و', 'O'), ('فرهنگسرای', 'Facility'), ('نیاوران', 'Facility'), ('و', 'O'), ('بهمن', 'Facility'), ('بر', 'O'), ('پا', 'O'), ('می\u200cشود', 'O'), ('.', 'O')]

  

  Example 6:
      Input: ['ایرن', 'ژاکوب', '،', 'هنرپیشه', 'فرانسوی', 'نیز', 'قرار', 'است', 'در', 'این', 'تئاتر', 'نقش', 'مقابل', 'کالکین', 'را', 'به', 'عهده', 'بگیرد', '.']
      Output: [('ایرن', 'PER'), ('ژاکوب', 'PER'), ('،', 'O'), ('هنرپیشه', 'O'), ('فرانسوی', 'ORG'), ('نیز', 'O'), ('قرار', 'O'), ('است', 'O'), ('در', 'O'), ('این', 'O'), ('تئاتر', 'O'), ('نقش', 'O'), ('مقابل', 'O'), ('کالکین', 'PER'), ('را', 'O'), ('به', 'O'), ('عهده', 'O'), ('بگیرد', 'O'), ('.', 'O')]

  

  Example 7:
      Input: ['برنامه', 'موسیقی', 'دوتارنوازی', 'به', 'معرفی', 'موسیقی', 'تربت\u200cجام', 'از', 'خطه', 'خراسان', 'می\u200cپردازد', '.']
      Output: [('برنامه', 'O'), ('موسیقی', 'O'), ('دوتارنوازی', 'O'), ('به', 'O'), ('معرفی', 'O'), ('موسیقی', 'O'), ('تربت\u200cجام', 'LOC'), ('از', 'O'), ('خطه', 'O'), ('خراسان', 'LOC'), ('می\u200cپردازد', 'O'), ('.', 'O')]

  

  Example 8:
      Input: ['رومئو', 'و', 'ژولیت', 'تمدید', 'شد', '.']
      Output: [('رومئو', 'Product'), ('و', 'Product'), ('ژولیت', 'Product'), ('تمدید', 'O'), ('شد', 'O'), ('.', 'O')]

  

  Example 9:
      Input: ['تامسون', 'كه', '0', 'سال', 'دارد', '،', 'در', 'فیلم', 'آرزوهای', 'بزرگ', '،', 'برگرفته', 'از', 'رمان', 'چارلز', 'دیکنز', 'بازی', 'کرده', 'است', '.']
      Output: [('تامسون', 'PER'), ('كه', 'O'), ('0', 'O'), ('سال', 'O'), ('دارد', 'O'), ('،', 'O'), ('در', 'O'), ('فیلم', 'Product'), ('آرزوهای', 'Product'), ('بزرگ', 'Product'), ('،', 'O'), ('برگرفته', 'O'), ('از', 'O'), ('رمان', 'O'), ('چارلز', 'PER'), ('دیکنز', 'PER'), ('بازی', 'O'), ('کرده', 'O'), ('است', 'O'), ('.', 'O')]

  

  Example 10:
      Input: ['رئیس', 'قوه', 'قضائیه', ':', 'درباره', 'مجازات', 'زندان', 'باید', 'تحولاتی', 'به', 'وجود', 'آید', '.']
      Output: [('رئیس', 'O'), ('قوه', 'ORG'), ('قضائیه', 'ORG'), (':', 'O'), ('درباره', 'O'), ('مجازات', 'O'), ('زندان', 'O'), ('باید', 'O'), ('تحولاتی', 'O'), ('به', 'O'), ('وجود', 'O'), ('آید', 'O'), ('.', 'O')]

  

  Example 11:
      Input: ['در', 'استان', 'قم', 'تاکنون', '0', 'اثر', 'تاریخی', 'به', 'ثبت', 'رسیده', 'است', '.']
      Output: [('در', 'O'), ('استان', 'LOC'), ('قم', 'LOC'), ('تاکنون', 'O'), ('0', 'O'), ('اثر', 'O'), ('تاریخی', 'O'), ('به', 'O'), ('ثبت', 'O'), ('رسیده', 'O'), ('است', 'O'), ('.', 'O')]

  

  Output Format:
  Your output format should be a list of tuples, where each tuple consists of a word from the input text and its corresponding named entity label.
  For words which are not part of any named entity, you should return 'O'.

  Input:
  {input}
  """

PERSIAN_THREE = """
  شرح وظیفه:
  شما باید یک لیست توکن فارسی داده شده را با برچسب های موجودیت اسمی برچسب گذاری کنید.
  برچسب های موجودیت اسمی:

  PER (نفر)
  LOC (مکان)
  ORG (سازمان)
  Product (محصول)
  Event (رویداد)
  Facility (تاسیسات)

  در اینجا تعدادی مثال برای این تسک آمده است:
    

  مثال 1:
      ورودی: ['حمید', 'طاهایی', 'افزود', ':', 'برای', 'اجرای', 'این', 'طرحها', '0', 'میلیارد', 'و', '0', 'میلیون', 'ریال', 'اعتبار', 'هزینه', 'شده', 'است', '.']
      خروجی: [('حمید', 'PER'), ('طاهایی', 'PER'), ('افزود', 'O'), (':', 'O'), ('برای', 'O'), ('اجرای', 'O'), ('این', 'O'), ('طرحها', 'O'), ('0', 'O'), ('میلیارد', 'O'), ('و', 'O'), ('0', 'O'), ('میلیون', 'O'), ('ریال', 'O'), ('اعتبار', 'O'), ('هزینه', 'O'), ('شده', 'O'), ('است', 'O'), ('.', 'O')]

  

  مثال 2:
      ورودی: ['مهندس', 'حبیب\u200cالله', 'بیطرف', '،', 'به', 'هنگام', 'دیدار', 'از', 'پروژه', 'مذکور', 'گفت', ':', 'هزینه', 'این', 'طرح', 'از', 'محل', 'اعتبارات', 'ملی', 'تهیه', 'می\u200cشود', '.']
      خروجی: [('مهندس', 'O'), ('حبیب\u200cالله', 'PER'), ('بیطرف', 'PER'), ('،', 'O'), ('به', 'O'), ('هنگام', 'O'), ('دیدار', 'O'), ('از', 'O'), ('پروژه', 'O'), ('مذکور', 'O'), ('گفت', 'O'), (':', 'O'), ('هزینه', 'O'), ('این', 'O'), ('طرح', 'O'), ('از', 'O'), ('محل', 'O'), ('اعتبارات', 'O'), ('ملی', 'O'), ('تهیه', 'O'), ('می\u200cشود', 'O'), ('.', 'O')]

  

  مثال 3:
      ورودی: ['هزینه', 'اجرای', 'طرح', 'آبرسانی', 'به', 'شهرضا', '0', 'میلیارد', 'ریال', 'اعلام', 'شده', 'است', '.']
      خروجی: [('هزینه', 'O'), ('اجرای', 'O'), ('طرح', 'O'), ('آبرسانی', 'O'), ('به', 'O'), ('شهرضا', 'LOC'), ('0', 'O'), ('میلیارد', 'O'), ('ریال', 'O'), ('اعلام', 'O'), ('شده', 'O'), ('است', 'O'), ('.', 'O')]

  

  مثال 4:
      ورودی: ['مزارع', 'سبز', 'سویا', 'در', 'استان', 'گلستان', 'حدود', '0', 'هزار', 'هکتار', 'است', '.']
      خروجی: [('مزارع', 'O'), ('سبز', 'O'), ('سویا', 'O'), ('در', 'O'), ('استان', 'LOC'), ('گلستان', 'LOC'), ('حدود', 'O'), ('0', 'O'), ('هزار', 'O'), ('هکتار', 'O'), ('است', 'O'), ('.', 'O')]

  

  مثال 5:
      ورودی: ['جشنواره', 'فیلم', 'دفاع', 'مقدس', 'از', '0', 'تا', '0', 'مهرماه', 'در', 'چهار', 'سینمای', 'تهران', 'و', 'فرهنگسرای', 'نیاوران', 'و', 'بهمن', 'بر', 'پا', 'می\u200cشود', '.']
      خروجی: [('جشنواره', 'Event'), ('فیلم', 'Event'), ('دفاع', 'Event'), ('مقدس', 'Event'), ('از', 'O'), ('0', 'O'), ('تا', 'O'), ('0', 'O'), ('مهرماه', 'O'), ('در', 'O'), ('چهار', 'O'), ('سینمای', 'O'), ('تهران', 'LOC'), ('و', 'O'), ('فرهنگسرای', 'Facility'), ('نیاوران', 'Facility'), ('و', 'O'), ('بهمن', 'Facility'), ('بر', 'O'), ('پا', 'O'), ('می\u200cشود', 'O'), ('.', 'O')]

  

  مثال 6:
      ورودی: ['ایرن', 'ژاکوب', '،', 'هنرپیشه', 'فرانسوی', 'نیز', 'قرار', 'است', 'در', 'این', 'تئاتر', 'نقش', 'مقابل', 'کالکین', 'را', 'به', 'عهده', 'بگیرد', '.']
      خروجی: [('ایرن', 'PER'), ('ژاکوب', 'PER'), ('،', 'O'), ('هنرپیشه', 'O'), ('فرانسوی', 'ORG'), ('نیز', 'O'), ('قرار', 'O'), ('است', 'O'), ('در', 'O'), ('این', 'O'), ('تئاتر', 'O'), ('نقش', 'O'), ('مقابل', 'O'), ('کالکین', 'PER'), ('را', 'O'), ('به', 'O'), ('عهده', 'O'), ('بگیرد', 'O'), ('.', 'O')]

  

  مثال 7:
      ورودی: ['برنامه', 'موسیقی', 'دوتارنوازی', 'به', 'معرفی', 'موسیقی', 'تربت\u200cجام', 'از', 'خطه', 'خراسان', 'می\u200cپردازد', '.']
      خروجی: [('برنامه', 'O'), ('موسیقی', 'O'), ('دوتارنوازی', 'O'), ('به', 'O'), ('معرفی', 'O'), ('موسیقی', 'O'), ('تربت\u200cجام', 'LOC'), ('از', 'O'), ('خطه', 'O'), ('خراسان', 'LOC'), ('می\u200cپردازد', 'O'), ('.', 'O')]

  

  مثال 8:
      ورودی: ['رومئو', 'و', 'ژولیت', 'تمدید', 'شد', '.']
      خروجی: [('رومئو', 'Product'), ('و', 'Product'), ('ژولیت', 'Product'), ('تمدید', 'O'), ('شد', 'O'), ('.', 'O')]

  

  مثال 9:
      ورودی: ['تامسون', 'كه', '0', 'سال', 'دارد', '،', 'در', 'فیلم', 'آرزوهای', 'بزرگ', '،', 'برگرفته', 'از', 'رمان', 'چارلز', 'دیکنز', 'بازی', 'کرده', 'است', '.']
      خروجی: [('تامسون', 'PER'), ('كه', 'O'), ('0', 'O'), ('سال', 'O'), ('دارد', 'O'), ('،', 'O'), ('در', 'O'), ('فیلم', 'Product'), ('آرزوهای', 'Product'), ('بزرگ', 'Product'), ('،', 'O'), ('برگرفته', 'O'), ('از', 'O'), ('رمان', 'O'), ('چارلز', 'PER'), ('دیکنز', 'PER'), ('بازی', 'O'), ('کرده', 'O'), ('است', 'O'), ('.', 'O')]

  

  مثال 10:
      ورودی: ['رئیس', 'قوه', 'قضائیه', ':', 'درباره', 'مجازات', 'زندان', 'باید', 'تحولاتی', 'به', 'وجود', 'آید', '.']
      خروجی: [('رئیس', 'O'), ('قوه', 'ORG'), ('قضائیه', 'ORG'), (':', 'O'), ('درباره', 'O'), ('مجازات', 'O'), ('زندان', 'O'), ('باید', 'O'), ('تحولاتی', 'O'), ('به', 'O'), ('وجود', 'O'), ('آید', 'O'), ('.', 'O')]

  

  مثال 11:
      ورودی: ['در', 'استان', 'قم', 'تاکنون', '0', 'اثر', 'تاریخی', 'به', 'ثبت', 'رسیده', 'است', '.']
      خروجی: [('در', 'O'), ('استان', 'LOC'), ('قم', 'LOC'), ('تاکنون', 'O'), ('0', 'O'), ('اثر', 'O'), ('تاریخی', 'O'), ('به', 'O'), ('ثبت', 'O'), ('رسیده', 'O'), ('است', 'O'), ('.', 'O')]

  

  فرمت خروجی:
  فرمت خروجی شما باید لیستی از تاپل ها باشد، که در آن هر تاپل از یک کلمه از متن ورودی و برچسب موجودیت اسمی مربوط به آن تشکیل شده باشد.
  برای کلماتی که بخشی از هیچ موجودیت اسمی نیستند، باید \"O\" را برگردانید.

  ورودی:
  {input}
  """